Tekla Open API Reference for Tekla Structures 2025
IGeometryNode.AcceptVisitor Method
 Entry method for the visitor pattern
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
void AcceptVisitor(
	IGeometryNodeVisitor visitor
)
Sub AcceptVisitor (
	visitor As IGeometryNodeVisitor
)
Parameters
visitor
Type: Tekla.Structures.Model.IGeometryNodeVisitor
[Missing <param name="visitor"/> documentation for "M:Tekla.Structures.Model.IGeometryNode.AcceptVisitor(Tekla.Structures.Model.IGeometryNodeVisitor)"]
See Also
Reference
IGeometryNode Interface
Tekla.Structures.Model Namespace